stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_rcc_ex.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL Extended  module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32U3xx_HAL_RCC_EX_H
#define __STM32U3xx_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx_hal_def.h"

/** @addtogroup STM32U3xx_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */


/* Exported types ------------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */

/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint32_t PeriphClockSelection;          /*!< The Extended Clock to be configured.
                                               This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */

  uint32_t Usart1ClockSelection;          /*!< Specifies USART1 clock source.
                                               This parameter can be a value of @ref RCCEx_USART1_Clock_Source */

  uint32_t Usart3ClockSelection;          /*!< Specifies USART3 clock source.
                                               This parameter can be a value of @ref RCCEx_USART3_Clock_Source */

  uint32_t Uart4ClockSelection;           /*!< Specifies UART4 clock source.
                                               This parameter can be a value of @ref RCCEx_UART4_Clock_Source */

  uint32_t Uart5ClockSelection;           /*!< Specifies UART5 clock source.
                                               This parameter can be a value of @ref RCCEx_UART5_Clock_Source */

  uint32_t I3c1ClockSelection;            /*!< Specifies I3C1 clock source.
                                               This parameter can be a value of @ref RCCEx_I3C1_Clock_Source */

  uint32_t I2c1ClockSelection;            /*!< Specifies I2C1 clock source.
                                               This parameter can be a value of @ref RCCEx_I2C1_Clock_Source */

  uint32_t I2c2ClockSelection;            /*!< Specifies I2C2 clock source.
                                               This parameter can be a value of @ref RCCEx_I2C2_Clock_Source */

  uint32_t I3c2ClockSelection;            /*!< Specifies I3C2 clock source.
                                               This parameter can be a value of @ref RCCEx_I3C2_Clock_Source */

  uint32_t Spi2ClockSelection;            /*!< Specifies SPI2 clock source
                                               This parameter can be a value of @ref RCCEx_SPI2_Clock_Source */

  uint32_t Lptim2ClockSelection;          /*!< Specifies LPTIM2 clock source.
                                               This parameter can be a value of @ref RCCEx_LPTIM2_Clock_Source */

  uint32_t Spi1ClockSelection;            /*!< Specifies SPI1 clock source
                                               This parameter can be a value of @ref RCCEx_SPI1_Clock_Source */

  uint32_t SystickClockSelection;         /*!< Specifies SYSTICK clock source.
                                               This parameter can be a value of @ref RCCEx_SYSTICK_Clock_Source */

  uint32_t FdcanClockSelection;           /*!< Specifies FDCAN clock source.
                                               This parameter can be a value of @ref RCCEx_FDCAN_Clock_Source */

  uint32_t IclkClockSelection;            /*!< Specifies ICLK Intermediate clock source.
                                               This parameter can be a value of @ref RCCEx_ICLK_Clock_Source */

  uint32_t Usb1ClockSelection;            /*!< Specifies USB1 clock source.
                                               This parameter can be a value of @ref RCCEx_USB1_Clock_Source */

  uint32_t TimIcClockSelection;           /*!< Specifies TIMIC clock source.
                                               This parameter can be a value of @ref RCCEx_TIMIC_Clock_Source */

  uint32_t Adf1ClockSelection;            /*!< Specifies ADF1 clock source
                                               This parameter can be a value of @ref RCCEx_ADF1_Clock_Source */

  uint32_t Spi3ClockSelection;            /*!< Specifies SPI3 clock source
                                               This parameter can be a value of @ref RCCEx_SPI3_Clock_Source */

  uint32_t Sai1ClockSelection;            /*!< Specifies SAI1 clock source.
                                               This parameter can be a value of @ref RCCEx_SAI1_Clock_Source */

  uint32_t RngClockSelection;             /*!< Specifies RNG clock source
                                               This parameter can be a value of @ref RCCEx_RNG_Clock_Source */

  uint32_t AdcDacClockSelection;          /*!< Specifies ADCDAC clock source.
                                               This parameter can be a value of @ref RCCEx_ADCDAC_Clock_Source */

  uint32_t AdcDacClockDivider;            /*!< Specifies ADCDAC clock divider.
                                               This parameter can be a value of @ref RCCEx_ADCDACDIV_Clock_Divider */

  uint32_t Dac1SampleHoldClockSelection;  /*!< Specifies DAC1 sample and hold clock source.
                                               This parameter can be a value of @ref RCCEx_DAC1_Sample_Hold_Clock_Source */

  uint32_t Octospi1ClockSelection;        /*!< Specifies OCTOSPI1 interface clock source.
                                               This parameter can be a value of @ref RCCEx_OCTOSPI1_Clock_Source */

  uint32_t Lpuart1ClockSelection;         /*!< Specifies LPUART1 clock source
                                               This parameter can be a value of @ref RCCEx_LPUART1_Clock_Source */

  uint32_t I2c3ClockSelection;            /*!< Specifies I2C3 clock source
                                               This parameter can be a value of @ref RCCEx_I2C3_Clock_Source */

  uint32_t Lptim34ClockSelection;         /*!< Specifies LPTIM34 clock source.
                                               This parameter can be a value of @ref RCCEx_LPTIM34_Clock_Source */

  uint32_t Lptim1ClockSelection;          /*!< Specifies LPTIM1 clock source
                                               This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source */

#if defined(USART2)
  uint32_t Usart2ClockSelection;          /*!< Specifies USART2 clock source.
                                               This parameter can be a value of @ref RCCEx_UART2_Clock_Source */
#endif /* USART2 */

#if defined(I2C4)
  uint32_t I2c4ClockSelection;            /*!< Specifies I2C4 clock source.
                                               This parameter can be a value of @ref RCCEx_I2C4_Clock_Source */
#endif /* I2C4 */

#if defined(SPI4)
  uint32_t Spi4ClockSelection;            /*!< Specifies SPI4 clock source
                                               This parameter can be a value of @ref RCCEx_SPI4_Clock_Source */
#endif /* SPI4 */

  uint32_t RTCClockSelection;             /*!< Specifies RTC clock source.
                                               This parameter can be a value of @ref RCC_RTC_Clock_Source */
} RCC_PeriphCLKInitTypeDef;

/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint32_t State;                         /*!< The PLL Mode state.
                                               This parameter can be a value of @ref RCC_MSIRCx_PLL_State */

  uint32_t InputSrce;                     /*!< The PLL input clock source to be selected.
                                               This parameter can be a value of @ref RCC_MSIRCx_PLL_Input */

  uint32_t FastMode;                      /*!< Specifies if Fast mode is enabled or not.
                                               This parameter can be a value of @ref RCC_MSIRCx_PLL_Fast */

  uint32_t MSIRC1PLLN;                    /*!< Specifies LSE multiplication factor for MSIRC1 only.
                                               This parameter can be a value of @ref RCC_MSIRC1_PLLN*/
} RCC_MSIRCxPLLTypeDef;
/**
  * @}
  */

