stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
/** @defgroup RCCEx_CRS_Exported_Types RCCEx CRS Exported Types
  * @{
  */
/**
  * @brief RCC_CRS Init structure definition
  */
typedef struct
{
  uint32_t Prescaler;             /*!< Specifies the division factor of the SYNC signal.
                                       This parameter can be a value of @ref RCCEx_CRS_SynchroDivider */

  uint32_t Source;                /*!< Specifies the SYNC signal source.
                                       This parameter can be a value of @ref RCCEx_CRS_SynchroSource */

  uint32_t Polarity;              /*!< Specifies the input polarity for the SYNC signal source.
                                       This parameter can be a value of @ref RCCEx_CRS_SynchroPolarity */

  uint32_t ReloadValue;           /*!< Specifies the value to be loaded in the frequency error counter with each SYNC event.
                                       It can be calculated in using macro __HAL_RCC_CRS_RELOADVALUE_CALCULATE(__FTARGET__, __FSYNC__)
                                       This parameter must be a number between 0 and 0xFFFF or a value of @ref RCCEx_CRS_ReloadValueDefault .*/

  uint32_t ErrorLimitValue;       /*!< Specifies the value to be used to evaluate the captured frequency error value.
                                       This parameter must be a number between 0 and 0xFF or a value of @ref RCCEx_CRS_ErrorLimitDefault */

  uint32_t HSI48CalibrationValue; /*!< Specifies a user-programmable trimming value to the HSI48 oscillator.
                                       This parameter must be a number between 0 and 0x7F or a value of @ref RCCEx_CRS_HSI48CalibrationDefault */

} RCC_CRSInitTypeDef;

/**
  * @brief RCC_CRS Synchronization structure definition
  */
typedef struct
{
  uint32_t ReloadValue;           /*!< Specifies the value loaded in the Counter reload value.
                                       This parameter must be a number between 0 and 0xFFFF */

  uint32_t HSI48CalibrationValue; /*!< Specifies value loaded in HSI48 oscillator smooth trimming.
                                       This parameter must be a number between 0 and 0x7F */

  uint32_t FreqErrorCapture;      /*!< Specifies the value loaded in the .FECAP, the frequency error counter
                                       value latched in the time of the last SYNC event.
                                       This parameter must be a number between 0 and 0xFFFF */

  uint32_t FreqErrorDirection;    /*!< Specifies the value loaded in the .FEDIR, the counting direction of the
                                       frequency error counter latched in the time of the last SYNC event.
                                       It shows whether the actual frequency is below or above the target.
                                       This parameter must be a value of @ref RCCEx_CRS_FreqErrorDirection*/

} RCC_CRSSynchroInfoTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection  RCCEx Periph Clock Selection
  * @{
  */
#define RCC_PERIPHCLK_USART1                0x00000001U
#define RCC_PERIPHCLK_USART3                0x00000002U
#define RCC_PERIPHCLK_UART4                 0x00000004U
#define RCC_PERIPHCLK_UART5                 0x00000008U
#define RCC_PERIPHCLK_I3C1                  0x00000010U
#define RCC_PERIPHCLK_I2C1                  0x00000020U
#define RCC_PERIPHCLK_I2C2                  0x00000040U
#define RCC_PERIPHCLK_I3C2                  0x00000080U
#define RCC_PERIPHCLK_SPI2                  0x00000100U
#define RCC_PERIPHCLK_LPTIM2                0x00000200U
#define RCC_PERIPHCLK_SPI1                  0x00000400U
#define RCC_PERIPHCLK_SYSTICK               0x00000800U
#define RCC_PERIPHCLK_FDCAN                 0x00001000U
#define RCC_PERIPHCLK_ICLK                  0x00002000U
#define RCC_PERIPHCLK_USB1                  0x00004000U
#define RCC_PERIPHCLK_TIMIC                 0x00008000U
#define RCC_PERIPHCLK_ADF1                  0x00010000U
#define RCC_PERIPHCLK_SPI3                  0x00020000U
#define RCC_PERIPHCLK_SAI1                  0x00040000U
#define RCC_PERIPHCLK_RNG                   0x00080000U
#define RCC_PERIPHCLK_ADCDAC                0x00100000U
#define RCC_PERIPHCLK_DAC1SH                0x00200000U
#define RCC_PERIPHCLK_OCTOSPI1              0x00400000U
#define RCC_PERIPHCLK_LPUART1               0x00800000U
#define RCC_PERIPHCLK_I2C3                  0x01000000U
#define RCC_PERIPHCLK_LPTIM34               0x02000000U
#define RCC_PERIPHCLK_LPTIM1                0x04000000U
#if defined(USART2)
#define RCC_PERIPHCLK_USART2                0x08000000U
#endif /* USART2 */
#if defined(I2C4)
#define RCC_PERIPHCLK_I2C4                  0x10000000U
#endif /* I2C4 */
#if defined(SPI4)
#define RCC_PERIPHCLK_SPI4                  0x20000000U
#endif /* SPI4 */
#define RCC_PERIPHCLK_RTC                   0x80000000U
/**
  * @}
  */

/** @defgroup RCCEx_USART1_Clock_Source USART1 Clock Source
  * @{
  */
#define RCC_USART1CLKSOURCE_PCLK2           0x00000000U
#define RCC_USART1CLKSOURCE_HSI             RCC_CCIPR1_USART1SEL
/**
  * @}
  */


/** @defgroup RCCEx_USART3_Clock_Source USART3 Clock Source
  * @{
  */
#define RCC_USART3CLKSOURCE_PCLK1           0x00000000U
#define RCC_USART3CLKSOURCE_HSI             RCC_CCIPR1_USART3SEL
/**
  * @}
  */

/** @defgroup RCCEx_UART4_Clock_Source UART4 Clock Source
  * @{
  */
#define RCC_UART4CLKSOURCE_PCLK1            0x00000000U
#define RCC_UART4CLKSOURCE_HSI              RCC_CCIPR1_UART4SEL
/**
  * @}
  */

/** @defgroup RCCEx_UART5_Clock_Source UART5 Clock Source
  * @{
  */
#define RCC_UART5CLKSOURCE_PCLK1            0x00000000U
#define RCC_UART5CLKSOURCE_HSI              RCC_CCIPR1_UART5SEL
/**
  * @}
  */

/** @defgroup RCCEx_I3C1_Clock_Source I3C1 Clock Source
  * @{
  */
#define RCC_I3C1CLKSOURCE_PCLK1             0x00000000U
#define RCC_I3C1CLKSOURCE_MSIK              RCC_CCIPR1_I3C1SEL
/**
  * @}
  */

/** @defgroup RCCEx_I2C1_Clock_Source I2C1 Clock Source
  * @{
  */
#define RCC_I2C1CLKSOURCE_PCLK1             0x00000000U
#define RCC_I2C1CLKSOURCE_MSIK              RCC_CCIPR1_I2C1SEL
/**
  * @}
  */

/** @defgroup RCCEx_I2C2_Clock_Source I2C2 Clock Source
  * @{
  */
#define RCC_I2C2CLKSOURCE_PCLK1             0x00000000U
#define RCC_I2C2CLKSOURCE_MSIK              RCC_CCIPR1_I2C2SEL
/**
  * @}
  */

