stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
/** @defgroup RCCEx_I3C2_Clock_Source I3C2 Clock Source
  * @{
  */
#define RCC_I3C2CLKSOURCE_PCLK2             0x00000000U
#define RCC_I3C2CLKSOURCE_MSIK              RCC_CCIPR1_I3C2SEL
/**
  * @}
  */


/** @defgroup RCCEx_SPI2_Clock_Source SPI2 Clock Source
  * @{
  */
#define RCC_SPI2CLKSOURCE_PCLK1             0x00000000U
#define RCC_SPI2CLKSOURCE_MSIK              RCC_CCIPR1_SPI2SEL
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM2_Clock_Source LPTIM2 Clock Source
  * @{
  */
#define RCC_LPTIM2CLKSOURCE_PCLK1           0x00000000U
#define RCC_LPTIM2CLKSOURCE_LSI             RCC_CCIPR1_LPTIM2SEL_0
#define RCC_LPTIM2CLKSOURCE_HSI             RCC_CCIPR1_LPTIM2SEL_1
#define RCC_LPTIM2CLKSOURCE_LSE             RCC_CCIPR1_LPTIM2SEL
/**
  * @}
  */

/** @defgroup RCCEx_SPI1_Clock_Source SPI1 Clock Source
  * @{
  */
#define RCC_SPI1CLKSOURCE_PCLK2             0x00000000U
#define RCC_SPI1CLKSOURCE_MSIK              RCC_CCIPR1_SPI1SEL
/**
  * @}
  */

/** @defgroup RCCEx_SYSTICK_Clock_Source SYSTICK Clock Source
  * @{
  */
#define RCC_SYSTICKCLKSOURCE_HCLK_DIV8      0x00000000U
#define RCC_SYSTICKCLKSOURCE_LSI            RCC_CCIPR1_SYSTICKSEL_0
#define RCC_SYSTICKCLKSOURCE_LSE            RCC_CCIPR1_SYSTICKSEL_1
/**
  * @}
  */

/** @defgroup RCCEx_FDCAN_Clock_Source FDCAN Clock Source
  * @{
  */
#define RCC_FDCANCLKSOURCE_SYSCLK           0x00000000U
#define RCC_FDCANCLKSOURCE_MSIK             RCC_CCIPR1_FDCANSEL
/**
  * @}
  */


/** @defgroup RCCEx_ICLK_Clock_Source ICLK Clock Source
  * @{
  */
#define RCC_ICLKCLKSOURCE_HSI48             0x00000000U
#define RCC_ICLKCLKSOURCE_MSIK              RCC_CCIPR1_ICLKSEL_0
#define RCC_ICLKCLKSOURCE_HSE               RCC_CCIPR1_ICLKSEL_1
#define RCC_ICLKCLKSOURCE_SYSCLK            RCC_CCIPR1_ICLKSEL
/**
  * @}
  */

/** @defgroup RCCEx_USB1_Clock_Source USB1 Clock Source
  * @{
  */
#define RCC_USB1CLKSOURCE_ICLK              0x00000000U
#define RCC_USB1CLKSOURCE_ICLK_DIV2         RCC_CCIPR1_USB1SEL
/**
  * @}
  */


/** @defgroup RCCEx_TIMIC_Clock_Source TIMIC Clock Source
  * @{
  */
#define RCC_TIMICCLKSOURCE_DISABLE                0x00000000U             /*!< Input capture clock selection disable */
/*!< HSI/256, MSIS/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture */
#define RCC_TIMICCLKSOURCE_MSISDIV1024_MSISDIV4   RCC_CCIPR1_TIMICSEL_2
/*!< HSI/256, MSIS/1024 and MSIK/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture */
#define RCC_TIMICCLKSOURCE_MSISDIV1024_MSIKDIV4   (RCC_CCIPR1_TIMICSEL_2 | RCC_CCIPR1_TIMICSEL_0)
/*!< HSI/256, MSIK/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture */
#define RCC_TIMICCLKSOURCE_MSIKDIV1024_MSISDIV4   (RCC_CCIPR1_TIMICSEL_2 | RCC_CCIPR1_TIMICSEL_1)
/*!< HSI/256, MSIK/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture */
#define RCC_TIMICCLKSOURCE_MSIKDIV1024_MSIKDIV4   (RCC_CCIPR1_TIMICSEL_2 | \
                                                   RCC_CCIPR1_TIMICSEL_1 | RCC_CCIPR1_TIMICSEL_0)
/**
  * @}
  */


/** @defgroup RCCEx_ADF1_Clock_Source ADF1 Clock Source
  * @{
  */
#define RCC_ADF1CLKSOURCE_HCLK              0x00000000U
#define RCC_ADF1CLKSOURCE_PIN               RCC_CCIPR2_ADF1SEL_0
#define RCC_ADF1CLKSOURCE_MSIK              RCC_CCIPR2_ADF1SEL_1
#define RCC_ADF1CLKSOURCE_SAI1K             (RCC_CCIPR2_ADF1SEL_1 | RCC_CCIPR2_ADF1SEL_0)
/**
  * @}
  */


/** @defgroup RCCEx_SPI3_Clock_Source SPI3 Clock Source
  * @{
  */
#define RCC_SPI3CLKSOURCE_PCLK1             0x00000000U
#define RCC_SPI3CLKSOURCE_MSIK              RCC_CCIPR2_SPI3SEL
/**
  * @}
  */

/** @defgroup RCCEx_SAI1_Clock_Source SAI1 Clock Source
  * @{
  */
#define RCC_SAI1CLKSOURCE_MSIK              0x00000000U
#define RCC_SAI1CLKSOURCE_PIN               RCC_CCIPR2_SAI1SEL_0
#define RCC_SAI1CLKSOURCE_HSE               RCC_CCIPR2_SAI1SEL_1
/**
  * @}
  */

/** @defgroup RCCEx_RNG_Clock_Source  RCCEx RNG Clock Source
  * @{
  */
#define RCC_RNGCLKSOURCE_HSI48              0x00000000U
#define RCC_RNGCLKSOURCE_MSIK               RCC_CCIPR2_RNGSEL
/**
  * @}
  */

/** @defgroup RCCEx_ADCDACDIV_Clock_Divider ADC DAC DIV Clock Divider
  * @{
  */
#define RCC_ADCDACCLK_DIV1                  0x00000000U
#define RCC_ADCDACCLK_DIV2                  RCC_CCIPR2_ADCDACPRE_0
#define RCC_ADCDACCLK_DIV4                  RCC_CCIPR2_ADCDACPRE_3
#define RCC_ADCDACCLK_DIV8                  (RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_0)
#define RCC_ADCDACCLK_DIV16                 (RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_1)
#define RCC_ADCDACCLK_DIV32                 (RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_1 | RCC_CCIPR2_ADCDACPRE_0)
#define RCC_ADCDACCLK_DIV64                 (RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_2)
#define RCC_ADCDACCLK_DIV128                (RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_0)
#define RCC_ADCDACCLK_DIV256                (RCC_CCIPR2_ADCDACPRE_3 | RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_1)
#define RCC_ADCDACCLK_DIV512                (RCC_CCIPR2_ADCDACPRE_3 | \
                                             RCC_CCIPR2_ADCDACPRE_2 | RCC_CCIPR2_ADCDACPRE_1 | RCC_CCIPR2_ADCDACPRE_0)
/**
  * @}
  */

/** @defgroup RCCEx_ADCDAC_Clock_Source ADCDAC Clock Source
  * @{
  */
#define RCC_ADCDACCLKSOURCE_HCLK            0x00000000U
#define RCC_ADCDACCLKSOURCE_HSE             RCC_CCIPR2_ADCDACSEL_0
#define RCC_ADCDACCLKSOURCE_MSIK            RCC_CCIPR2_ADCDACSEL_1
/**
  * @}
  */

/** @defgroup RCCEx_DAC1_Sample_Hold_Clock_Source DAC1 Sample and Hold Clock Source
  * @{
  */
#define RCC_DAC1SHCLKSOURCE_LSI             0x00000000U
#define RCC_DAC1SHCLKSOURCE_LSE             RCC_CCIPR2_DAC1SHSEL
/**
  * @}
  */

/** @defgroup RCCEx_OCTOSPI1_Clock_Source OCTOSPI1 Clock Source
  * @{
  */
#define RCC_OCTOSPICLKSOURCE_SYSCLK         0x00000000U
#define RCC_OCTOSPICLKSOURCE_MSIK           RCC_CCIPR2_OCTOSPISEL
/**
  * @}
  */

/** @defgroup RCCEx_LPUART1_Clock_Source LPUART1 Clock Source
  * @{
  */
#define RCC_LPUART1CLKSOURCE_PCLK3          0x00000000U
#define RCC_LPUART1CLKSOURCE_HSI            RCC_CCIPR3_LPUART1SEL_0
#define RCC_LPUART1CLKSOURCE_LSE            RCC_CCIPR3_LPUART1SEL_1
#define RCC_LPUART1CLKSOURCE_MSIK           (RCC_CCIPR3_LPUART1SEL_1 | RCC_CCIPR3_LPUART1SEL_0)
/**
  * @}
  */

/** @defgroup RCCEx_I2C3_Clock_Source I2C3 Clock Source
  * @{
  */
#define RCC_I2C3CLKSOURCE_PCLK3             0x00000000U
#define RCC_I2C3CLKSOURCE_MSIK              RCC_CCIPR3_I2C3SEL
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM34_Clock_Source LPTIM34 Clock Source
  * @{
  */
#define RCC_LPTIM34CLKSOURCE_MSIK           0x00000000U
#define RCC_LPTIM34CLKSOURCE_LSI            RCC_CCIPR3_LPTIM34SEL_0
#define RCC_LPTIM34CLKSOURCE_HSI            RCC_CCIPR3_LPTIM34SEL_1
#define RCC_LPTIM34CLKSOURCE_LSE            (RCC_CCIPR3_LPTIM34SEL_1 | RCC_CCIPR3_LPTIM34SEL_0)
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM1_Clock_Source LPTIM1 Clock Source
  * @{
  */
#define RCC_LPTIM1CLKSOURCE_MSIK            0x00000000U
#define RCC_LPTIM1CLKSOURCE_LSI             RCC_CCIPR3_LPTIM1SEL_0
#define RCC_LPTIM1CLKSOURCE_HSI             RCC_CCIPR3_LPTIM1SEL_1
#define RCC_LPTIM1CLKSOURCE_LSE             (RCC_CCIPR3_LPTIM1SEL_1 | RCC_CCIPR3_LPTIM1SEL_0)
/**
  * @}
  */

#if defined(USART2)
/** @defgroup RCCEx_USART2_Clock_Source USART2 Clock Source
  * @{
  */
#define RCC_USART2CLKSOURCE_PCLK1           0x00000000U
#define RCC_USART2CLKSOURCE_HSI           RCC_CCIPR2_USART2SEL
/**
  * @}
  */
#endif /* USART2 */

#if defined(I2C4)
/** @defgroup RCCEx_I2C4_Clock_Source I2C4 Clock Source
  * @{
  */
#define RCC_I2C4CLKSOURCE_PCLK1             0x00000000U
#define RCC_I2C4CLKSOURCE_MSIK              RCC_CCIPR2_I2C4SEL
/**
  * @}
  */
#endif /* I2C4 */

#if defined(SPI4)
/** @defgroup RCCEx_SPI4_Clock_Source SPI4 Clock Source
  * @{
  */
#define RCC_SPI4CLKSOURCE_PCLK1             0x00000000U
#define RCC_SPI4CLKSOURCE_MSIK              RCC_CCIPR2_SPI4SEL
/**
  * @}
  */
#endif /* SPI4 */


