stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
/** @defgroup RCC_EPOD_Booster_Source EPOD Booster Source
  * @{
  */
#define RCC_EPODBOOSTER_SOURCE_NONE     0x00000000U                                   /*!< EPOD booster source is disabled (power saving) */
#define RCC_EPODBOOSTER_SOURCE_MSIS     RCC_CFGR4_BOOSTSEL_0                          /*!< EPOD booster source is MSIS */
#define RCC_EPODBOOSTER_SOURCE_HSI      RCC_CFGR4_BOOSTSEL_1                          /*!< EPOD booster source is HSI */
#define RCC_EPODBOOSTER_SOURCE_HSE      (RCC_CFGR4_BOOSTSEL_1 | RCC_CFGR4_BOOSTSEL_0) /*!< EPOD booster source is HSE */

/**
  * @}
  */

/** @defgroup RCC_EPOD_Booster_Div EPOD Booster Divider
  * @{
  */
#define RCC_EPODBOOSTER_DIV1            0x00000000U                                                           /*!< EPOD Booster clock source divided by 1 */
#define RCC_EPODBOOSTER_DIV2            RCC_CFGR4_BOOSTDIV_0                                                  /*!< EPOD Booster clock source divided by 2 */
#define RCC_EPODBOOSTER_DIV4            RCC_CFGR4_BOOSTDIV_1                                                  /*!< EPOD Booster clock source divided by 4 */
#define RCC_EPODBOOSTER_DIV6            (RCC_CFGR4_BOOSTDIV_1 | RCC_CFGR4_BOOSTDIV_0)                         /*!< EPOD Booster clock source divided by 6 */
#define RCC_EPODBOOSTER_DIV8            RCC_CFGR4_BOOSTDIV_2                                                  /*!< EPOD Booster clock source divided by 8 */
#define RCC_EPODBOOSTER_DIV10           (RCC_CFGR4_BOOSTDIV_2 | RCC_CFGR4_BOOSTDIV_0)                         /*!< EPOD Booster clock source divided by 10 */
#define RCC_EPODBOOSTER_DIV12           (RCC_CFGR4_BOOSTDIV_2 | RCC_CFGR4_BOOSTDIV_1)                         /*!< EPOD Booster clock source divided by 12 */
#define RCC_EPODBOOSTER_DIV14           (RCC_CFGR4_BOOSTDIV_2 | RCC_CFGR4_BOOSTDIV_1 | RCC_CFGR4_BOOSTDIV_0)  /*!< EPOD Booster clock source divided by 14 */
#define RCC_EPODBOOSTER_DIV16           RCC_CFGR4_BOOSTDIV_3                                                  /*!< EPOD Booster clock source divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_MSIRCx_PLL_State MSIRCx PLL State
  * @{
  */
#define RCC_MSIRCx_PLL_OFF                  0x00000000U           /*!< MSIRCx PLL mode enable */
#define RCC_MSIRCx_PLL_ON                   RCC_CR_MSIPLL1EN      /*!< MSIRCx PLL mode disable */
/**
  * @}
  */

/** @defgroup RCC_MSIRCx_PLL_Input MSIRCx PLL Input
  * @{
  */
#define RCC_MSIRCx_PLL_INPUT_LSE            0x00000000U           /*!< LSE selected as MSIRCx PLL input */
#define RCC_MSIRCx_PLL_INPUT_HSE            RCC_ICSCR1_MSIPLL1SEL /*!< HSE selected as MSIRCx PLL input */
/**
  * @}
  */

/** @defgroup RCC_MSIRCx_PLL_HSE_Input_Frequency MSIRCx PLL HSE Input Frequency
  * @{
  */
#define RCC_MSIRCx_PLL_INPUT_HSE32                  32000000U      /*!< HSE frequency is 32 MHz */
#define RCC_MSIRCx_PLL_INPUT_HSE16                  16000000U      /*!< HSE frequency is 16 MHz */
/**
  * @}
  */

/** @defgroup RCC_MSIRCx_PLL_Fast MSIRCx PLL Fast
  * @{
  */
#define RCC_MSIRCx_PLL_FAST_DISABLE         0x00000000U           /*!< PLL fast mode disable */
#define RCC_MSIRCx_PLL_FAST_ENABLE          RCC_CR_MSIPLL1FAST    /*!< PLL fast mode enable */
/**
  * @}
  */

/** @defgroup RCC_MSIRC1_PLLN MSIRC1 PLLN factor
  * @{
  */
#define RCC_MSIRC1_PLLN_732                 0x00000000U                                     /*!< MSIRC1 frequency is  23.9862 MHz */
#define RCC_MSIRC1_PLLN_689                 RCC_ICSCR1_MSIPLL1N_1                           /*!< MSIRC1 frequency is  22.5772 MHz */
#define RCC_MSIRC1_PLLN_780                 (RCC_ICSCR1_MSIPLL1N_1 | RCC_ICSCR1_MSIPLL1N_0) /*!< MSIRC1 frequency is  24.576 MHz */
/**
  * @}
  */

/** @defgroup RCC_MSIRCx_PLL_Unlock MSIRCx PLL Unlock
  * @{
  */
#define RCC_MSIRCx_PLL_UNLCK_LSE            RCC_CIER_MSIPLLUIE    /*!< PLL unlock interrupt for LSE source */
#define RCC_MSIRCx_PLL_UNLCK_HSE            RCC_CIER_MSIPLLHSUIE  /*!< PLL unlock interrupt for HSE source */
/**
  * @}
  */

/** @defgroup RCC_Stop_SystemWakeUpClock Wakeup from Stop System Clock
  * @{
  */
#define RCC_STOP_WKUP_SYSCLK_MSIS           0x00000000U
#define RCC_STOP_WKUP_SYSCLK_HSI            RCC_CFGR1_STOPWUCK
/**
  * @}
  */

/** @defgroup RCC_Kernel_Clock Kernel clock
  * @{
  */
#define RCC_KERNELCLK_MSIK                  RCC_CR_MSIKERON
#define RCC_KERNELCLK_HSI                   RCC_CR_HSIKERON
/**
  * @}
  */

/** @defgroup RCCEx_LSCO_Clock_Source Low Speed Clock Source
  * @{
  */
#define RCC_LSCOSOURCE_LSI                  0x00000000U           /*!< LSI selection for low speed clock output */
#define RCC_LSCOSOURCE_LSE                  RCC_BDCR_LSCOSEL      /*!< LSE selection for low speed clock output */
/**
  * @}
  */

/**
  * @}
  */


/** @defgroup RCCEx_CRS_Exported_Constants RCCEx CRS Exported Constants
  * @{
  */
/** @defgroup RCCEx_CRS_Status RCCEx CRS Status
  * @{
  */
#define RCC_CRS_NONE                        0x00000000U
#define RCC_CRS_TIMEOUT                     0x00000001U
#define RCC_CRS_SYNCOK                      0x00000002U
#define RCC_CRS_SYNCWARN                    0x00000004U
#define RCC_CRS_SYNCERR                     0x00000008U
#define RCC_CRS_SYNCMISS                    0x00000010U
#define RCC_CRS_TRIMOVF                     0x00000020U
/**
  * @}
  */

/** @defgroup RCCEx_CRS_SynchroSource RCCEx CRS SynchroSource
  * @{
  */
#define RCC_CRS_SYNC_SOURCE_GPIO            0x00000000U             /*!< Synchro Signal source GPIO */
#define RCC_CRS_SYNC_SOURCE_LSE             CRS_CFGR_SYNCSRC_0      /*!< Synchro Signal source LSE */
#define RCC_CRS_SYNC_SOURCE_USB             CRS_CFGR_SYNCSRC_1      /*!< Synchro Signal source USB SOF */
/**
  * @}
  */

/** @defgroup RCCEx_CRS_SynchroDivider RCCEx CRS SynchroDivider
  * @{
  */
#define RCC_CRS_SYNC_DIV1                   0x00000000U                               /*!< Synchro Signal not divided (default) */
#define RCC_CRS_SYNC_DIV2                   CRS_CFGR_SYNCDIV_0                        /*!< Synchro Signal divided by 2 */
#define RCC_CRS_SYNC_DIV4                   CRS_CFGR_SYNCDIV_1                        /*!< Synchro Signal divided by 4 */
#define RCC_CRS_SYNC_DIV8                   (CRS_CFGR_SYNCDIV_1 | CRS_CFGR_SYNCDIV_0) /*!< Synchro Signal divided by 8 */
#define RCC_CRS_SYNC_DIV16                  CRS_CFGR_SYNCDIV_2                        /*!< Synchro Signal divided by 16 */
#define RCC_CRS_SYNC_DIV32                  (CRS_CFGR_SYNCDIV_2 | CRS_CFGR_SYNCDIV_0) /*!< Synchro Signal divided by 32 */
#define RCC_CRS_SYNC_DIV64                  (CRS_CFGR_SYNCDIV_2 | CRS_CFGR_SYNCDIV_1) /*!< Synchro Signal divided by 64 */
#define RCC_CRS_SYNC_DIV128                 CRS_CFGR_SYNCDIV                          /*!< Synchro Signal divided by 128 */
/**
  * @}
  */

/** @defgroup RCCEx_CRS_SynchroPolarity RCCEx CRS SynchroPolarity
  * @{
  */
#define RCC_CRS_SYNC_POLARITY_RISING        0x00000000U         /*!< Synchro Active on rising edge (default) */
#define RCC_CRS_SYNC_POLARITY_FALLING       CRS_CFGR_SYNCPOL    /*!< Synchro Active on falling edge */
/**
  * @}
  */

/** @defgroup RCCEx_CRS_ReloadValueDefault RCCEx CRS ReloadValueDefault
  * @{
  */
#define RCC_CRS_RELOADVALUE_DEFAULT         0x0000BB7FU   /*!< The reset value of the RELOAD field corresponds
                                                               to a target frequency of 48 MHz and a synchronization signal frequency of 1 kHz (SOF signal from USB). */
/**
  * @}
  */

/** @defgroup RCCEx_CRS_ErrorLimitDefault RCCEx CRS ErrorLimitDefault
  * @{
  */
#define RCC_CRS_ERRORLIMIT_DEFAULT          0x00000022U   /*!< Default Frequency error limit */
/**
  * @}
  */

/** @defgroup RCCEx_CRS_HSI48CalibrationDefault RCCEx CRS HSI48CalibrationDefault
  * @{
  */
#define RCC_CRS_HSI48CALIBRATION_DEFAULT    0x00000040U /*!< The default value is 64, which corresponds to the middle of the trimming interval.
                                                             The trimming step is specified in the product datasheet. A higher TRIM value
                                                             corresponds to a higher output frequency */
/**
  * @}
  */

/** @defgroup RCCEx_CRS_FreqErrorDirection RCCEx CRS FreqErrorDirection
  * @{
  */
#define RCC_CRS_FREQERRORDIR_UP             0x00000000U   /*!< Upcounting direction, the actual frequency is above the target */
#define RCC_CRS_FREQERRORDIR_DOWN           CRS_ISR_FEDIR /*!< Downcounting direction, the actual frequency is below the target */
/**
  * @}
  */

/** @defgroup RCCEx_CRS_Interrupt_Sources RCCEx CRS Interrupt Sources
  * @{
  */
#define RCC_CRS_IT_SYNCOK                   CRS_CR_SYNCOKIE       /*!< SYNC event OK */
#define RCC_CRS_IT_SYNCWARN                 CRS_CR_SYNCWARNIE     /*!< SYNC warning */
#define RCC_CRS_IT_ERR                      CRS_CR_ERRIE          /*!< Error */
#define RCC_CRS_IT_ESYNC                    CRS_CR_ESYNCIE        /*!< Expected SYNC */
#define RCC_CRS_IT_SYNCERR                  CRS_CR_ERRIE          /*!< SYNC error */
#define RCC_CRS_IT_SYNCMISS                 CRS_CR_ERRIE          /*!< SYNC missed */
#define RCC_CRS_IT_TRIMOVF                  CRS_CR_ERRIE           /*!< Trimming overflow or underflow */
/**
  * @}
  */

/** @defgroup RCCEx_CRS_Flags RCCEx CRS Flags
  * @{
  */
#define RCC_CRS_FLAG_SYNCOK                 CRS_ISR_SYNCOKF       /*!< SYNC event OK flag     */
#define RCC_CRS_FLAG_SYNCWARN               CRS_ISR_SYNCWARNF     /*!< SYNC warning flag      */
#define RCC_CRS_FLAG_ERR                    CRS_ISR_ERRF          /*!< Error flag        */
#define RCC_CRS_FLAG_ESYNC                  CRS_ISR_ESYNCF        /*!< Expected SYNC flag     */
#define RCC_CRS_FLAG_SYNCERR                CRS_ISR_SYNCERR       /*!< SYNC error */
#define RCC_CRS_FLAG_SYNCMISS               CRS_ISR_SYNCMISS      /*!< SYNC missed*/
#define RCC_CRS_FLAG_TRIMOVF                CRS_ISR_TRIMOVF       /*!< Trimming overflow or underflow */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Macros RCCEx Exported Macros
  * @{
  */

/** @brief  Macro to configure the USART1 clock (USART1CLK).
  * @param  __USART1_CLKSOURCE__ specifies the USART1 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_USART1CLKSOURCE_PCLK2  PCLK2 selected as USART1 clock
  *            @arg @ref RCC_USART1CLKSOURCE_HSI    HSI selected as USART1 clock
  * @retval None
  */
#define __HAL_RCC_USART1_CONFIG(__USART1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_USART1SEL, (__USART1_CLKSOURCE__))

/** @brief  Macro to get the USART1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_USART1CLKSOURCE_PCLK2  PCLK2 selected as USART1 clock
  *            @arg @ref RCC_USART1CLKSOURCE_HSI    HSI selected as USART1 clock
  */
#define __HAL_RCC_GET_USART1_SOURCE()       READ_BIT(RCC->CCIPR1, RCC_CCIPR1_USART1SEL)

/** @brief  Macro to configure the USART3 clock (USART3CLK).
  * @param  __USART3_CLKSOURCE__ specifies the USART3 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_USART3CLKSOURCE_PCLK1  PCLK1 selected as USART3 clock
  *            @arg @ref RCC_USART3CLKSOURCE_HSI    HSI selected as USART3 clock
  * @retval None
  */
#define __HAL_RCC_USART3_CONFIG(__USART3_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_USART3SEL, (__USART3_CLKSOURCE__))

