stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
/** @brief  Macro to configure the LPTIM2 clock (LPTIM2CLK).
  * @param  __LPTIM2_CLKSOURCE__ specifies the LPTIM2 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_LPTIM2CLKSOURCE_PCLK1  PCLK1 selected as LPTIM2 clock
  *            @arg @ref RCC_LPTIM2CLKSOURCE_LSI    LSI selected as LPTIM2 clock
  *            @arg @ref RCC_LPTIM2CLKSOURCE_HSI    HSI selected as LPTIM2 clock
  *            @arg @ref RCC_LPTIM2CLKSOURCE_LSE    LSE selected as LPTIM2 clock
  * @retval None
  */
#define __HAL_RCC_LPTIM2_CONFIG(__LPTIM2_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_LPTIM2SEL, (__LPTIM2_CLKSOURCE__))

/** @brief  Macro to get the LPTIM2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_LPTIM2CLKSOURCE_PCLK1  PCLK1 selected as LPTIM2 clock
  *            @arg @ref RCC_LPTIM2CLKSOURCE_LSI    LSI selected as LPTIM2 clock
  *            @arg @ref RCC_LPTIM2CLKSOURCE_HSI    HSI selected as LPTIM2 clock
  *            @arg @ref RCC_LPTIM2CLKSOURCE_LSE    LSE selected as LPTIM2 clock
  */
#define __HAL_RCC_GET_LPTIM2_SOURCE()       READ_BIT(RCC->CCIPR1, RCC_CCIPR1_LPTIM2SEL)

/** @brief  macro to configure the SPI1 clock source.
  * @param  __SPI1_CLKSOURCE__ specifies the SPI1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_SPI1CLKSOURCE_PCLK2   PCLK2 Clock selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_MSIK    MSIK Clock selected as SPI1 clock
  */
#define __HAL_RCC_SPI1_CONFIG(__SPI1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_SPI1SEL, (__SPI1_CLKSOURCE__))

/** @brief  macro to get the SPI1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI1CLKSOURCE_PCLK2   PCLK2 Clock selected as SPI1 clock
  *            @arg RCC_SPI1CLKSOURCE_MSIK    MSIK Clock selected as SPI1 clock
  */
#define __HAL_RCC_GET_SPI1_SOURCE()         READ_BIT(RCC->CCIPR1, RCC_CCIPR1_SPI1SEL)

/** @brief  macro to configure the SYSTICK clock source.
  * @param  __SYSTICK_CLKSOURCE__ specifies the SYSTICK clock source.
  *            @arg RCC_SYSTICKCLKSOURCE_HCLK_DIV8  HCLK divided by 8 Clock selected as SYSTICK clock
  *            @arg RCC_SYSTICKCLKSOURCE_LSI        LSI Clock selected as SYSTICK clock
  *            @arg RCC_SYSTICKCLKSOURCE_LSE        LSE Clock selected as SYSTICK clock
  */
#define __HAL_RCC_SYSTICK_CONFIG(__SYSTICK_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_SYSTICKSEL, (__SYSTICK_CLKSOURCE__))

/** @brief  macro to get the SYSTICK clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SYSTICKCLKSOURCE_HCLK_DIV8  HCLK divided by 8 Clock selected as SYSTICK clock
  *            @arg RCC_SYSTICKCLKSOURCE_LSI        LSI Clock selected as SYSTICK clock
  *            @arg RCC_SYSTICKCLKSOURCE_LSE        LSE Clock selected as SYSTICK clock
  */
#define __HAL_RCC_GET_SYSTICK_SOURCE()      READ_BIT(RCC->CCIPR1, RCC_CCIPR1_SYSTICKSEL)

/** @brief  macro to configure the FDCAN clock source.
  * @param  __FDCAN_CLKSOURCE__ specifies the FDCAN clock source.
  *            @arg RCC_FDCANCLKSOURCE_SYSCLK  SYSCLK divided by 8 Clock selected as FDCAN clock
  *            @arg RCC_FDCANCLKSOURCE_MSIK    MSIK Clock selected as FDCAN clock
  */
#define __HAL_RCC_FDCAN_CONFIG(__FDCAN_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_FDCANSEL, (__FDCAN_CLKSOURCE__))

/** @brief  macro to get the FDCAN clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_FDCANCLKSOURCE_SYSCLK  SYSCLK divided by 8 Clock selected as FDCAN clock
  *            @arg RCC_FDCANCLKSOURCE_MSIK    MSIK Clock selected as FDCAN clock
  */
#define __HAL_RCC_GET_FDCAN_SOURCE()       READ_BIT(RCC->CCIPR1, RCC_CCIPR1_FDCANSEL)

/** @brief  Macro to configure the ICLK clock.
  * @param  __ICLK_CLKSOURCE__ specifies the ICLK clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_ICLKCLKSOURCE_HSI48  HSI48 selected as ICLK clock
  *            @arg @ref RCC_ICLKCLKSOURCE_MSIK   MSIK selected as ICLK clock
  *            @arg @ref RCC_ICLKCLKSOURCE_HSE    HSE selected as ICLK clock
  *            @arg @ref RCC_ICLKCLKSOURCE_SYSCLK System Clock selected as ICLK clock
  * @retval None
  */
#define __HAL_RCC_ICLK_CONFIG(__ICLK_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_ICLKSEL, (__ICLK_CLKSOURCE__))

/** @brief  Macro to get the ICLK clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_ICLKCLKSOURCE_HSI48  HSI48 selected as ICLK clock
  *            @arg @ref RCC_ICLKCLKSOURCE_MSIK   MSIK selected as ICLK clock
  *            @arg @ref RCC_ICLKCLKSOURCE_HSE    HSE selected as ICLK clock
  *            @arg @ref RCC_ICLKCLKSOURCE_SYSCLK System Clock selected as ICLK clock
  */
#define __HAL_RCC_GET_ICLK_SOURCE()         READ_BIT(RCC->CCIPR1, RCC_CCIPR1_ICLKSEL)

/** @brief  macro to configure the USB1 clock source.
  * @param  __USB1_CLKSOURCE__ specifies the USB1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USB1CLKSOURCE_ICLK        Intermediate Clock selected as USB1 clock
  *            @arg RCC_USB1CLKSOURCE_ICLK_DIV2   Intermediate Clock divide by 2 selected as USB1 clock
  */
#define __HAL_RCC_USB1_CONFIG(__USB1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_USB1SEL, (__USB1_CLKSOURCE__))

/** @brief  macro to get the USB1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USB1CLKSOURCE_ICLK        Intermediate Clock selected as USB1 clock
  *            @arg RCC_USB1CLKSOURCE_ICLK_DIV2   Intermediate Clock divide by 2 selected as USB1 clock
  */
#define __HAL_RCC_GET_USB1_SOURCE()         READ_BIT(RCC->CCIPR1, RCC_CCIPR1_USB1SEL)

/** @brief  macro to configure the TIMIC clock source.
  * @param  __TIMIC_CLKSOURCE__ specifies the TIMIC clock source.
  *            @arg RCC_TIMICCLKSOURCE_DISABLE                Input capture clock selection disable
  *            @arg RCC_TIMICCLKSOURCE_MSISDIV1024_MSISDIV4   HSI/256, MSIS/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture
  *            @arg RCC_TIMICCLKSOURCE_MSISDIV1024_MSIKDIV4   HSI/256, MSIS/1024 and MSIK/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture
  *            @arg RCC_TIMICCLKSOURCE_MSIKDIV1024_MSISDIV4   HSI/256, MSIK/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture
  *            @arg RCC_TIMICCLKSOURCE_MSIKDIV1024_MSIKDIV4   HSI/256, MSIK/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture
  */
#define __HAL_RCC_TIMIC_CONFIG(__TIMIC_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_TIMICSEL, (__TIMIC_CLKSOURCE__))

/** @brief  macro to get the TIMIC clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_TIMICCLKSOURCE_DISABLE                Input capture clock selection disable
  *            @arg RCC_TIMICCLKSOURCE_MSISDIV1024_MSISDIV4   HSI/256, MSIS/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture
  *            @arg RCC_TIMICCLKSOURCE_MSISDIV1024_MSIKDIV4   HSI/256, MSIS/1024 and MSIK/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture
  *            @arg RCC_TIMICCLKSOURCE_MSIKDIV1024_MSISDIV4   HSI/256, MSIK/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture
  *            @arg RCC_TIMICCLKSOURCE_MSIKDIV1024_MSIKDIV4   HSI/256, MSIK/1024 and MSIS/4 selected by TIM16, TIM17 and LPTIM2 as internal input capture
  */
#define __HAL_RCC_GET_TIMIC_SOURCE()        READ_BIT(RCC->CCIPR1, RCC_CCIPR1_TIMICSEL)

/** @brief  Macro to configure the ADF1 clock.
  * @param  __ADF1_CLKSOURCE__ specifies the ADF1 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_ADF1CLKSOURCE_HCLK   HCLK selected as ADF1 clock
  *            @arg @ref RCC_ADF1CLKSOURCE_PIN    Input PIN Audioclk selected as ADF1 clock
  *            @arg @ref RCC_ADF1CLKSOURCE_MSIK   MSIK selected as ADF1 clock
  *            @arg @ref RCC_ADF1CLKSOURCE_SAI1K  SAI1 kernel clock selected as ADF1 clock
  * @retval None
  */
#define __HAL_RCC_ADF1_CONFIG(__ADF1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_ADF1SEL, (__ADF1_CLKSOURCE__))

