stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
/** @brief  Macro to get the ADF1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_ADF1CLKSOURCE_HCLK   HCLK selected as ADF1 clock
  *            @arg @ref RCC_ADF1CLKSOURCE_PIN    Input PIN Audioclk selected as ADF1 clock
  *            @arg @ref RCC_ADF1CLKSOURCE_MSIK   MSIK selected as ADF1 clock
  *            @arg @ref RCC_ADF1CLKSOURCE_SAI1K  SAI1 kernel clock selected as ADF1 clock
  */
#define __HAL_RCC_GET_ADF1_SOURCE()         READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ADF1SEL)

/** @brief  macro to configure the SPI3 clock source.
  * @param  __SPI3_CLKSOURCE__ specifies the SPI3 clock source.es:
  *            @arg RCC_SPI3CLKSOURCE_PCLK1   PCLK1 selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_MSIK    MSIK Clock selected as SPI3 clock
  */
#define __HAL_RCC_SPI3_CONFIG(__SPI3_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_SPI3SEL, (__SPI3_CLKSOURCE__))

/** @brief  macro to get the SPI3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI3CLKSOURCE_PCLK1   PCLK1 selected as SPI3 clock
  *            @arg RCC_SPI3CLKSOURCE_MSIK    MSIK Clock selected as SPI3 clock
  */
#define __HAL_RCC_GET_SPI3_SOURCE()         READ_BIT(RCC->CCIPR2, RCC_CCIPR2_SPI3SEL)

/**
  * @brief  Macro to configure the SAI1 clock source.
  * @param  __SAI1_CLKSOURCE__ defines the SAI1 clock source. This clock is derived
  *         from the HSI, SYSCLK or external clock (through a dedicated pin).
  *          This parameter can be one of the following values:
  *             @arg @ref RCC_SAI1CLKSOURCE_MSIK  MSIK Clock selected as SPI3 clock
  *             @arg @ref RCC_SAI1CLKSOURCE_PIN   Input PIN Audioclk Clock selected as SPI3 clock
  *             @arg @ref RCC_SAI1CLKSOURCE_HSE   HSE Clock selected as SPI3 clock
  * @retval None
  */
#define __HAL_RCC_SAI1_CONFIG(__SAI1_CLKSOURCE__)\
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_SAI1SEL, (__SAI1_CLKSOURCE__))

/** @brief  Macro to get the SAI1 clock source.
  * @retval The clock source can be one of the following values:
  *             @arg @ref RCC_SAI1CLKSOURCE_MSIK  MSIK Clock selected as SPI3 clock
  *             @arg @ref RCC_SAI1CLKSOURCE_PIN   Input PIN Audioclk Clock selected as SPI3 clock
  *             @arg @ref RCC_SAI1CLKSOURCE_HSE   HSE Clock selected as SPI3 clock
  */
#define __HAL_RCC_GET_SAI1_SOURCE()         READ_BIT(RCC->CCIPR2, RCC_CCIPR2_SAI1SEL)

/** @brief macro to configure the RNG clock source.
  * @param  __RNG_CLKSOURCE__: specifies the RNG clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_RNGCLKSOURCE_HSI48  HSI48  selected as RNG clock
  *            @arg RCC_RNGCLKSOURCE_MSIK   MSIK selected as RNG clock
  * @retval None
  */
#define __HAL_RCC_RNG_CONFIG(__RNG_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_RNGSEL, (__RNG_CLKSOURCE__))

/** @brief  macro to get the RNG clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_RNGCLKSOURCE_HSI48  HSI48 selected as RNG clock
  *            @arg RCC_RNGCLKSOURCE_MSIK   MSIK selected as RNG clock
  */
#define __HAL_RCC_GET_RNG_SOURCE()          READ_BIT(RCC->CCIPR2, RCC_CCIPR2_RNGSEL)

/** @brief  Macro to configure the ADC12 and DAC1 kernel clock divider.
  * @param  __ADCDAC_CLKDIV__ specifies the ADC12 and DAC1 digital interface clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_ADCDACCLK_DIV1     ADC12 and DAC1 kernel clock divided by 1
  *            @arg @ref RCC_ADCDACCLK_DIV2     ADC12 and DAC1 kernel clock divided by 2
  *            @arg @ref RCC_ADCDACCLK_DIV4     ADC12 and DAC1 kernel clock divided by 4
  *            @arg @ref RCC_ADCDACCLK_DIV8     ADC12 and DAC1 kernel clock divided by 8
  *            @arg @ref RCC_ADCDACCLK_DIV16    ADC12 and DAC1 kernel clock divided by 16
  *            @arg @ref RCC_ADCDACCLK_DIV32    ADC12 and DAC1 kernel clock divided by 32
  *            @arg @ref RCC_ADCDACCLK_DIV64    ADC12 and DAC1 kernel clock divided by 64
  *            @arg @ref RCC_ADCDACCLK_DIV128   ADC12 and DAC1 kernel clock divided by 128
  *            @arg @ref RCC_ADCDACCLK_DIV256   ADC12 and DAC1 kernel clock divided by 256
  *            @arg @ref RCC_ADCDACCLK_DIV512   ADC12 and DAC1 kernel clock divided by 512
  * @retval None
  */
#define __HAL_RCC_ADCDAC_DIV_CONFIG(__ADCDAC_CLKDIV__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_ADCDACPRE, (__ADCDAC_CLKDIV__))

/** @brief  Macro to get the ADC12 and DAC1 kernel clock divider.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_ADCDACCLK_DIV1     ADC12 and DAC1 kernel clock divided by 1
  *            @arg @ref RCC_ADCDACCLK_DIV2     ADC12 and DAC1 kernel clock divided by 2
  *            @arg @ref RCC_ADCDACCLK_DIV4     ADC12 and DAC1 kernel clock divided by 4
  *            @arg @ref RCC_ADCDACCLK_DIV8     ADC12 and DAC1 kernel clock divided by 8
  *            @arg @ref RCC_ADCDACCLK_DIV16    ADC12 and DAC1 kernel clock divided by 16
  *            @arg @ref RCC_ADCDACCLK_DIV32    ADC12 and DAC1 kernel clock divided by 32
  *            @arg @ref RCC_ADCDACCLK_DIV64    ADC12 and DAC1 kernel clock divided by 64
  *            @arg @ref RCC_ADCDACCLK_DIV128   ADC12 and DAC1 kernel clock divided by 128
  *            @arg @ref RCC_ADCDACCLK_DIV256   ADC12 and DAC1 kernel clock divided by 256
  *            @arg @ref RCC_ADCDACCLK_DIV512   ADC12 and DAC1 kernel clock divided by 512
  */
#define __HAL_RCC_GET_ADCDAC_DIV()          READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ADCDACPRE)

/** @brief  Macro to configure the ADC12 and DAC1 clock source.
  * @param  __ADCDAC_CLKSOURCE__ specifies the ADC12 and DAC1 digital interface clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_ADCDACCLKSOURCE_HCLK HCLK clock selected as ADC12 and DAC1 clock
  *            @arg @ref RCC_ADCDACCLKSOURCE_HSE  HSE clock selected as ADC12 and DAC1 clock
  *            @arg @ref RCC_ADCDACCLKSOURCE_MSIK MSIK clock selected as ADC12 and DAC1 clock
  * @retval None
  */
#define __HAL_RCC_ADCDAC_CONFIG(__ADCDAC_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_ADCDACSEL, (__ADCDAC_CLKSOURCE__))

/** @brief  Macro to get the ADC12 and DAC1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_ADCDACCLKSOURCE_HCLK HCLK clock selected as ADC12 and DAC1 clock
  *            @arg @ref RCC_ADCDACCLKSOURCE_HSE  HSE clock selected as ADC12 and DAC1 clock
  *            @arg @ref RCC_ADCDACCLKSOURCE_MSIK MSIK clock selected as ADC12 and DAC1 clock
  */
#define __HAL_RCC_GET_ADCDAC_SOURCE()       READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ADCDACSEL)

/** @brief  Macro to configure the DAC1 sample and hold clock source.
  * @param  __DAC1SH_CLKSOURCE__ specifies the DAC1 digital interface clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_DAC1SHCLKSOURCE_LSE HCLK clock selected as DAC1 sample and hold clock
  *            @arg @ref RCC_DAC1SHCLKSOURCE_LSI  HSE clock selected as DAC1 sample and hold clock
  * @retval None
  */
#define __HAL_RCC_DAC1SH_CONFIG(__DAC1SH_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_DAC1SHSEL, (__DAC1SH_CLKSOURCE__))

/** @brief  Macro to get the DAC1 sample and hold clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_DAC1SHCLKSOURCE_LSE HCLK clock selected as DAC1 sample and hold clock
  *            @arg @ref RCC_DAC1SHCLKSOURCE_LSI  HSE clock selected as DAC1 sample and hold clock
  */
#define __HAL_RCC_GET_DAC1SH_SOURCE()       READ_BIT(RCC->CCIPR2, RCC_CCIPR2_DAC1SHSEL)


/** @brief macro to configure the OCTOSPI clock source.
  * @param  __OCTOSPI_CLKSOURCE__: specifies the OCTOSPI clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_OCTOSPICLKSOURCE_SYSCLK   SYSCLK  selected as OCTOSPI clock
  *            @arg RCC_OCTOSPICLKSOURCE_MSIK     MSIK selected as OCTOSPI clock
  * @retval None
  */
#define __HAL_RCC_OCTOSPI_CONFIG(__OCTOSPI_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_OCTOSPISEL, (__OCTOSPI_CLKSOURCE__))

/** @brief  macro to get the OCTOSPI clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_OCTOSPICLKSOURCE_SYSCLK   SYSCLK  selected as OCTOSPI clock
  *            @arg RCC_OCTOSPICLKSOURCE_MSIK     MSIK selected as OCTOSPI clock
  */
#define __HAL_RCC_GET_OCTOSPI_SOURCE()      READ_BIT(RCC->CCIPR2, RCC_CCIPR2_OCTOSPISEL)

/** @brief  Macro to configure the LPUART1 clock.
  * @param  __LPUART1_CLKSOURCE__ specifies the LPUART1 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_LPUART1CLKSOURCE_PCLK3 PCLK3 selected as LPUART1 clock
  *            @arg @ref RCC_LPUART1CLKSOURCE_HSI   HSI selected as LPUART1 clock
  *            @arg @ref RCC_LPUART1CLKSOURCE_LSE   LSE selected as LPUART1 clock
  *            @arg @ref RCC_LPUART1CLKSOURCE_MSIK  MSIK selected as LPUART1 clock
  * @retval None
  */
#define __HAL_RCC_LPUART1_CONFIG(__LPUART1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_LPUART1SEL, (__LPUART1_CLKSOURCE__))

/** @brief  Macro to get the LPUART1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_LPUART1CLKSOURCE_PCLK3 PCLK3 selected as LPUART1 clock
  *            @arg @ref RCC_LPUART1CLKSOURCE_HSI   HSI selected as LPUART1 clock
  *            @arg @ref RCC_LPUART1CLKSOURCE_LSE   LSE selected as LPUART1 clock
  *            @arg @ref RCC_LPUART1CLKSOURCE_MSIK  MSIK selected as LPUART1 clock
  */
#define __HAL_RCC_GET_LPUART1_SOURCE()      READ_BIT(RCC->CCIPR3, RCC_CCIPR3_LPUART1SEL)

/** @brief  Macro to configure the I2C3 clock.
  * @param  __I2C3_CLKSOURCE__ specifies the I2C3 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_I2C3CLKSOURCE_PCLK3  PCLK3 selected as I2C3 clock
  *            @arg @ref RCC_I2C3CLKSOURCE_MSIK   MSIK selected as I2C3 clock
  * @retval None
  */
#define __HAL_RCC_I2C3_CONFIG(__I2C3_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_I2C3SEL, (__I2C3_CLKSOURCE__))

