stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
/** @addtogroup RCCEx_Private_Constants
  * @{
  */
/* Define used for IS_RCC_* macros below */
#if defined(STM32U385xx) || defined(STM32U375xx)
#define RCC_PERIPHCLOCK_ALL                 (RCC_PERIPHCLK_USART1 | RCC_PERIPHCLK_USART3   | RCC_PERIPHCLK_UART4   | \
                                             RCC_PERIPHCLK_UART5  | RCC_PERIPHCLK_I3C1     | RCC_PERIPHCLK_I2C1    | \
                                             RCC_PERIPHCLK_I2C2   | RCC_PERIPHCLK_I3C2     | RCC_PERIPHCLK_SPI2    | \
                                             RCC_PERIPHCLK_LPTIM2 | RCC_PERIPHCLK_SPI1     | RCC_PERIPHCLK_SYSTICK | \
                                             RCC_PERIPHCLK_FDCAN  | RCC_PERIPHCLK_ICLK     | RCC_PERIPHCLK_USB1    | \
                                             RCC_PERIPHCLK_TIMIC  | RCC_PERIPHCLK_ADF1     | RCC_PERIPHCLK_SPI3    | \
                                             RCC_PERIPHCLK_SAI1   | RCC_PERIPHCLK_RNG      | RCC_PERIPHCLK_ADCDAC  | \
                                             RCC_PERIPHCLK_DAC1SH | RCC_PERIPHCLK_OCTOSPI1 | RCC_PERIPHCLK_LPUART1 | \
                                             RCC_PERIPHCLK_I2C3   | RCC_PERIPHCLK_LPTIM34  | RCC_PERIPHCLK_LPTIM1  | \
                                             RCC_PERIPHCLK_RTC)
#endif /* STM32U385xx || STM32U375xx */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCCEx_Private_Macros
  * @{
  */
#define IS_RCC_PERIPHCLOCK(__SELECTION__)         ((((__SELECTION__) & RCC_PERIPHCLOCK_ALL) != 0x00u) && \
                                                   (((__SELECTION__) & ~RCC_PERIPHCLOCK_ALL) == 0x00u))

#define IS_RCC_USART1CLKSOURCE(__SOURCE__)        (((__SOURCE__) == RCC_USART1CLKSOURCE_PCLK2)  || \
                                                   ((__SOURCE__) == RCC_USART1CLKSOURCE_HSI))

#define IS_RCC_USART3CLKSOURCE(__SOURCE__)        (((__SOURCE__) == RCC_USART3CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_USART3CLKSOURCE_HSI))

#define IS_RCC_UART4CLKSOURCE(__SOURCE__)         (((__SOURCE__) == RCC_UART4CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_UART4CLKSOURCE_HSI))

#define IS_RCC_UART5CLKSOURCE(__SOURCE__)         (((__SOURCE__) == RCC_UART5CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_UART5CLKSOURCE_HSI))

#define IS_RCC_I3C1CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_I3C1CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_I3C1CLKSOURCE_MSIK))

#define IS_RCC_I2C1CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_I2C1CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_I2C1CLKSOURCE_MSIK))

#define IS_RCC_I2C2CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_I2C2CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_I2C2CLKSOURCE_MSIK))

#define IS_RCC_I3C2CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_I3C2CLKSOURCE_PCLK2)  || \
                                                   ((__SOURCE__) == RCC_I3C2CLKSOURCE_MSIK))

#define IS_RCC_SPI2CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_SPI2CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_SPI2CLKSOURCE_MSIK))

#define IS_RCC_LPTIM2CLKSOURCE(__SOURCE__)        (((__SOURCE__) == RCC_LPTIM2CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_LSI)    || \
                                                   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_HSI)    || \
                                                   ((__SOURCE__) == RCC_LPTIM2CLKSOURCE_LSE))

#define IS_RCC_SPI1CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_SPI1CLKSOURCE_PCLK2)  || \
                                                   ((__SOURCE__) == RCC_SPI1CLKSOURCE_MSIK))

#define IS_RCC_SYSTICKCLKSOURCE(__SOURCE__)       (((__SOURCE__) == RCC_SYSTICKCLKSOURCE_HCLK_DIV8)  || \
                                                   ((__SOURCE__) == RCC_SYSTICKCLKSOURCE_LSI)        || \
                                                   ((__SOURCE__) == RCC_SYSTICKCLKSOURCE_LSE))

#define IS_RCC_FDCANCLKSOURCE(__SOURCE__)         (((__SOURCE__) == RCC_FDCANCLKSOURCE_SYSCLK)  || \
                                                   ((__SOURCE__) == RCC_FDCANCLKSOURCE_MSIK))

#define IS_RCC_ICLKCLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_ICLKCLKSOURCE_HSI48)  || \
                                                   ((__SOURCE__) == RCC_ICLKCLKSOURCE_MSIK)   || \
                                                   ((__SOURCE__) == RCC_ICLKCLKSOURCE_HSE)    || \
                                                   ((__SOURCE__) == RCC_ICLKCLKSOURCE_SYSCLK))

#define IS_RCC_USB1CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_USB1CLKSOURCE_ICLK)   || \
                                                   ((__SOURCE__) == RCC_USB1CLKSOURCE_ICLK_DIV2))

#define IS_RCC_TIMICCLKSOURCE(__SOURCE__)         (((__SOURCE__) == RCC_TIMICCLKSOURCE_DISABLE)               || \
                                                   ((__SOURCE__) == RCC_TIMICCLKSOURCE_MSISDIV1024_MSISDIV4)  || \
                                                   ((__SOURCE__) == RCC_TIMICCLKSOURCE_MSISDIV1024_MSIKDIV4)  || \
                                                   ((__SOURCE__) == RCC_TIMICCLKSOURCE_MSIKDIV1024_MSISDIV4)  || \
                                                   ((__SOURCE__) == RCC_TIMICCLKSOURCE_MSIKDIV1024_MSIKDIV4))

#define IS_RCC_ADF1CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_ADF1CLKSOURCE_HCLK)   || \
                                                   ((__SOURCE__) == RCC_ADF1CLKSOURCE_PIN)    || \
                                                   ((__SOURCE__) == RCC_ADF1CLKSOURCE_MSIK)   || \
                                                   ((__SOURCE__) == RCC_ADF1CLKSOURCE_SAI1K))

#define IS_RCC_SPI3CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_SPI3CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_SPI3CLKSOURCE_MSIK))

