stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
#define IS_RCC_SAI1CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_SAI1CLKSOURCE_MSIK) || \
                                                   ((__SOURCE__) == RCC_SAI1CLKSOURCE_PIN)  || \
                                                   ((__SOURCE__) == RCC_SAI1CLKSOURCE_HSE))

#define IS_RCC_RNGCLKSOURCE(__SOURCE__)           (((__SOURCE__) == RCC_RNGCLKSOURCE_HSI48) || \
                                                   ((__SOURCE__) == RCC_RNGCLKSOURCE_MSIK))

#define IS_RCC_ADCDAC_DIV(__DIVIDER__)            (((__DIVIDER__) == RCC_ADCDACCLK_DIV1)    || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV2)    || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV4)    || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV8)    || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV16)   || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV32)   || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV64)   || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV128)  || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV256)  || \
                                                   ((__DIVIDER__) == RCC_ADCDACCLK_DIV512))

#define IS_RCC_ADCDACCLKSOURCE(__SOURCE__)        (((__SOURCE__) == RCC_ADCDACCLKSOURCE_HCLK) || \
                                                   ((__SOURCE__) == RCC_ADCDACCLKSOURCE_HSE)  || \
                                                   ((__SOURCE__) == RCC_ADCDACCLKSOURCE_MSIK))

#define IS_RCC_DAC1SHCLKSOURCE(__SOURCE__)        (((__SOURCE__) == RCC_DAC1SHCLKSOURCE_LSI) || \
                                                   ((__SOURCE__) == RCC_DAC1SHCLKSOURCE_LSE))


#define IS_RCC_OCTOSPICLKSOURCE(__SOURCE__)       (((__SOURCE__) == RCC_OCTOSPICLKSOURCE_SYSCLK) || \
                                                   ((__SOURCE__) == RCC_OCTOSPICLKSOURCE_MSIK))

#define IS_RCC_LPUART1CLKSOURCE(__SOURCE__)       (((__SOURCE__) == RCC_LPUART1CLKSOURCE_PCLK3) || \
                                                   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_HSI)   || \
                                                   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_LSE)   || \
                                                   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_MSIK))

#define IS_RCC_I2C3CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_I2C3CLKSOURCE_PCLK3)   || \
                                                   ((__SOURCE__) == RCC_I2C3CLKSOURCE_MSIK))

#define IS_RCC_LPTIM34CLKSOURCE(__SOURCE__)       (((__SOURCE__) == RCC_LPTIM34CLKSOURCE_MSIK)  || \
                                                   ((__SOURCE__) == RCC_LPTIM34CLKSOURCE_LSI)   || \
                                                   ((__SOURCE__) == RCC_LPTIM34CLKSOURCE_HSI)   || \
                                                   ((__SOURCE__) == RCC_LPTIM34CLKSOURCE_LSE))

#define IS_RCC_LPTIM1CLKSOURCE(__SOURCE__)        (((__SOURCE__) == RCC_LPTIM1CLKSOURCE_MSIK)   || \
                                                   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSI)    || \
                                                   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_HSI)    || \
                                                   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSE))

#if defined(USART2)
#define IS_RCC_USART2CLKSOURCE(__SOURCE__)        (((__SOURCE__) == RCC_USART2CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_USART2CLKSOURCE_HSI))
#endif /* USART2 */

#if defined(I2C4)
#define IS_RCC_I2C4CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_I2C4CLKSOURCE_PCLK1)   || \
                                                   ((__SOURCE__) == RCC_I2C4CLKSOURCE_MSIK))
#endif /* I2C4 */

#if defined(SPI4)
#define IS_RCC_SPI4CLKSOURCE(__SOURCE__)          (((__SOURCE__) == RCC_SPI4CLKSOURCE_PCLK1)  || \
                                                   ((__SOURCE__) == RCC_SPI4CLKSOURCE_MSIK))
#endif /* SPI4 */

#define IS_RCC_EPODBOOSTER_SOURCE(__SRCE__)       (((__SRCE__) == RCC_EPODBOOSTER_SOURCE_NONE) || \
                                                   ((__SRCE__) == RCC_EPODBOOSTER_SOURCE_MSIS) || \
                                                   ((__SRCE__) == RCC_EPODBOOSTER_SOURCE_HSI) || \
                                                   ((__SRCE__) == RCC_EPODBOOSTER_SOURCE_HSE))

#define IS_RCC_EPODBOOSTER_DIV(__DIV__)           (((__DIV__) == RCC_EPODBOOSTER_DIV1) || \
                                                   ((__DIV__) == RCC_EPODBOOSTER_DIV2) || \
                                                   ((__DIV__) == RCC_EPODBOOSTER_DIV4) || \
                                                   ((__DIV__) == RCC_EPODBOOSTER_DIV6) || \
                                                   ((__DIV__) == RCC_EPODBOOSTER_DIV8) || \
                                                   ((__DIV__) == RCC_EPODBOOSTER_DIV10) || \
                                                   ((__DIV__) == RCC_EPODBOOSTER_DIV12) || \
                                                   ((__DIV__) == RCC_EPODBOOSTER_DIV14) || \
                                                   ((__DIV__) == RCC_EPODBOOSTER_DIV16))

#define IS_RCC_MSI_PLL(__STATE__)                 (((__STATE__) == RCC_MSIRCx_PLL_ON)   ||  \
                                                   ((__STATE__) == RCC_MSIRCx_PLL_OFF))

#define IS_RCC_MSI_PLL_INPUT(__SOURCE__)          (((__SOURCE__) == RCC_MSIRCx_PLL_INPUT_LSE) || \
                                                   ((__SOURCE__) == RCC_MSIRCx_PLL_INPUT_HSE))

#define IS_RCC_MSI_PLL_INPUT_HSE_FREQ(__VALUE__)  (((__VALUE__) == RCC_MSIRCx_PLL_INPUT_HSE16) || \
                                                   ((__VALUE__) == RCC_MSIRCx_PLL_INPUT_HSE32))

