stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc_ex.h
#define IS_RCC_MSI_PLL_FASTMODE(__MODE__)         (((__MODE__) == RCC_MSIRCx_PLL_FAST_DISABLE)  || \
                                                   ((__MODE__) == RCC_MSIRCx_PLL_FAST_ENABLE))

#define IS_RCC_MSI_PLL_NVALUE(__VALUE__)          (((__VALUE__) == RCC_MSIRC1_PLLN_732)   || \
                                                   ((__VALUE__) == RCC_MSIRC1_PLLN_689)  || \
                                                   ((__VALUE__) == RCC_MSIRC1_PLLN_780))

#define IS_RCC_STOP_WKUP_SYSCLK(__SOURCE__)       (((__SOURCE__) == RCC_STOP_WKUP_SYSCLK_MSIS) || \
                                                   ((__SOURCE__) == RCC_STOP_WKUP_SYSCLK_HSI))

#define IS_RCC_KERNEL_CLK(__SOURCE__)             (((__SOURCE__) == RCC_KERNELCLK_MSIK) || \
                                                   ((__SOURCE__) == RCC_KERNELCLK_HSI))

#define IS_RCC_MULTI_KERNEL_CLK(__SOURCE__)       ((((__SOURCE__) & (RCC_KERNELCLK_MSIK | RCC_KERNELCLK_HSI)) != 0x00UL) && \
                                                   (((__SOURCE__) & ~(RCC_KERNELCLK_MSIK | RCC_KERNELCLK_HSI)) == 0x00UL))

#define IS_RCC_MSI_STANDBY_DIV(__DIV__)           (((__DIV__) == RCC_MSI_DIV2) || ((__DIV__) == RCC_MSI_DIV4) || \
                                                   ((__DIV__) == RCC_MSI_DIV8))

#define IS_RCC_LSCOSOURCE(__SOURCE__)             (((__SOURCE__) == RCC_LSCOSOURCE_LSI) || \
                                                   ((__SOURCE__) == RCC_LSCOSOURCE_LSE))
/**
  * @}
  */

/** @addtogroup RCCEx_CRS_Private_Macros
  * @{
  */
#define IS_RCC_CRS_SYNC_SOURCE(__SOURCE__)        (((__SOURCE__) == RCC_CRS_SYNC_SOURCE_GPIO) || \
                                                   ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_LSE) || \
                                                   ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_USB))

#define IS_RCC_CRS_SYNC_DIV(__DIV__)              (((__DIV__) == RCC_CRS_SYNC_DIV1)  || ((__DIV__) == RCC_CRS_SYNC_DIV2)  || \
                                                   ((__DIV__) == RCC_CRS_SYNC_DIV4)  || ((__DIV__) == RCC_CRS_SYNC_DIV8)  || \
                                                   ((__DIV__) == RCC_CRS_SYNC_DIV16) || ((__DIV__) == RCC_CRS_SYNC_DIV32) || \
                                                   ((__DIV__) == RCC_CRS_SYNC_DIV64) || ((__DIV__) == RCC_CRS_SYNC_DIV128))

#define IS_RCC_CRS_SYNC_POLARITY(__POLARITY__)    (((__POLARITY__) == RCC_CRS_SYNC_POLARITY_RISING) || \
                                                   ((__POLARITY__) == RCC_CRS_SYNC_POLARITY_FALLING))

#define IS_RCC_CRS_RELOADVALUE(__VALUE__)         (((__VALUE__) <= 0xFFFFU))

#define IS_RCC_CRS_ERRORLIMIT(__VALUE__)          (((__VALUE__) <= 0xFFU))

#define IS_RCC_CRS_HSI48CALIBRATION(__VALUE__)    (((__VALUE__) <= 0x7FU))

#define IS_RCC_CRS_FREQERRORDIR(__DIR__)          (((__DIR__) == RCC_CRS_FREQERRORDIR_UP) || \
                                                   ((__DIR__) == RCC_CRS_FREQERRORDIR_DOWN))
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32U3xx_HAL_RCC_EX_H */
